{
  "backend/main.mo": "Motoko canister defining product, user, and site-content types with maps and admin-gated mutating methods using access control and storage mixins.",
  "backend/migration.mo": "Stub migration module that returns the previous actor unchanged.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files used for build or documentation reference.",
  "frontend/.env.example": "Example environment file defining WhatsApp number configuration.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook documenting steps to retry deployment with diagnostic output.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app with client-side routing via pathname parsing and setup for React Query and theming.",
  "frontend/src/components/admin/AdminAuthDiagnostics.tsx": "Displays parsed admin auth errors with collapsible technical details and a copy-to-clipboard option.",
  "frontend/src/components/admin/HomepageBannersManager.tsx": "Empty file with no implementation.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout handling Internet Identity login, backend readiness checks, admin verification, and recovery actions.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links, social icons, and branding, calling onNavigate for internal navigation.",
  "frontend/src/components/GuestMergePrompt.tsx": "Displays a dialog prompting users to merge guest cart or wishlist items into their account.",
  "frontend/src/components/Header.tsx": "Implements the main site header with navigation, search, theme toggle, and mobile menu, using guest cart and wishlist counts.",
  "frontend/src/components/home/ContactCtaSection.tsx": "Renders a contact call‑to‑action section with contact info and a button that navigates to the contact page.",
  "frontend/src/components/home/CustomerReviewsSection.tsx": "Shows a grid of static customer reviews with star ratings and styled cards.",
  "frontend/src/components/home/HomepageBannerRail.tsx": "Carousel component for homepage banners with autoplay, navigation arrows, and optional CTA actions.",
  "frontend/src/components/home/HomepageProductSection.tsx": "Displays a product grid with optional filter navigation and a section title.",
  "frontend/src/components/home/HomepageSectionRenderer.tsx": "Renders dynamic content sections with optional images and an about-page CTA.",
  "frontend/src/components/home/OffersSection.tsx": "Displays promotional offer banners with images, text, and navigation to filtered catalog views.",
  "frontend/src/components/home/PartnersSection.tsx": "Static partners showcase section with a header and a logos strip image.",
  "frontend/src/components/Logo.tsx": "Simple logo component rendering a circular image at configurable sizes.",
  "frontend/src/components/MediaSlotUploader.tsx": "Provides an image upload slot with preview, replace, and remove actions using ExternalBlob uploads.",
  "frontend/src/components/ProductCard.tsx": "Shows a product card with hover image swap, wishlist and cart actions, and navigation to the product page.",
  "frontend/src/components/RichTextEditor.tsx": "A simple rich text editor with toolbar formatting buttons and contentEditable support.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary component showing detailed error info with options to copy, export logs, and reload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Provides a helper that checks backend admin status before allowing protected operations.",
  "frontend/src/hooks/useAdminSession.ts": "Manages local admin session state with login, logout, and session validation using backend admin checks.",
  "frontend/src/hooks/useBackendReadiness.ts": "Checks if the backend is reachable and ready by calling actor.isReady with retry and polling behavior.",
  "frontend/src/hooks/useGuestCart.ts": "Stores and updates a guest user’s cart in local storage with add, remove, and clear helpers.",
  "frontend/src/hooks/useGuestWishlist.ts": "Maintains a guest wishlist in local storage with add, remove, and clear operations.",
  "frontend/src/hooks/useHomepageBanners.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines product, admin, and cart-related queries and mutations using the backend actor.",
  "frontend/src/hooks/useSiteContent.ts": "Fetches and updates site content, enforcing admin checks on mutations.",
  "frontend/src/hooks/useStorefrontAnnouncement.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useThemeMode.ts": "Controls site theme based on user override or admin-configured default and applies it to the document.",
  "frontend/src/index.css": "Defines Tailwind layers, custom color variables, dark mode styles, and utility classes for a premium gold-themed UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with brand mission, images, and value cards highlighting product quality and pilgrim-focused features.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Provides an admin view listing product categories with search, sorting, and statistics derived from all products.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing product, category, lookbook stats and quick actions using data fetched from queries.",
  "frontend/src/pages/admin/AdminLookbook.tsx": "Admin interface for managing lookbook images with search, sorting, add/edit dialogs, uploads, and product tagging.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Admin interface for listing, filtering, sorting, creating, updating, and deleting products with image upload and form management.",
  "frontend/src/pages/admin/AdminSessions.tsx": "Displays read‑only information about guest sessions and how cart and wishlist data are stored locally.",
  "frontend/src/pages/admin/AdminSiteSettings.tsx": "Admin page for editing hero text, contact details, and toggling dark mode using site content API hooks.",
  "frontend/src/pages/Cart.tsx": "Implements the shopping cart page with guest cart handling, product details, subtotal calculation, and navigation options.",
  "frontend/src/pages/Checkout.tsx": "Displays the checkout summary and generates a WhatsApp checkout link using cart details and pricing.",
  "frontend/src/pages/Contact.tsx": "Builds the contact page with store info, dynamic site content, and a user message form.",
  "frontend/src/pages/Diagnostics.tsx": "Developer diagnostics page showing backend readiness, actor status, and runtime logs with export and clearing tools.",
  "frontend/src/pages/HomePage.tsx": "Homepage displaying banners, category cards, and curated product sections like best sellers and new arrivals.",
  "frontend/src/pages/Lookbook.tsx": "Lookbook page showing styled images with tagged products and a detail dialog for viewing image information.",
  "frontend/src/pages/ProductCatalog.tsx": "Product catalog with filtering, sorting, and category/product‑type selectors, displaying filtered product cards.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page showing product info, gallery, size/color selection, and actions for cart and wishlist.",
  "frontend/src/pages/Returns.tsx": "Renders the returns and exchanges info page with policies, steps, and support details using styled cards and prose sections.",
  "frontend/src/pages/Shipping.tsx": "Displays shipping information including delivery times, packaging, processing, tracking, and policy details.",
  "frontend/src/pages/Wishlist.tsx": "Shows the user's wishlist, allowing navigation, removal, clearing, and adding items to cart using product and wishlist hooks.",
  "frontend/src/utils/adminAuthError.ts": "Parses backend or network errors into categorized admin auth error messages with suggested next steps.",
  "frontend/src/utils/adminSession.ts": "Manages admin session persistence in localStorage, including reading, saving, clearing, and resetting sessions.",
  "frontend/src/utils/bannerDestination.ts": "Encodes, decodes, and handles navigation behavior for banner destination metadata such as catalog, product, or external links.",
  "frontend/src/utils/bannerEncoding.ts": "Encodes and decodes banner text objects to and from JSON for storage or rendering.",
  "frontend/src/utils/currency.ts": "Provides INR currency formatting helpers for prices with and without the currency symbol.",
  "frontend/src/utils/devLogBuffer.ts": "Captures console logs and errors into an in‑memory buffer with export and download utilities for debugging.",
  "frontend/src/utils/localCart.ts": "Handles reading, saving, versioning, and clearing the guest shopping cart from localStorage.",
  "frontend/src/utils/localWishlist.ts": "Manages a versioned guest wishlist in localStorage with get, save, and clear helpers.",
  "frontend/src/utils/productImageFallback.ts": "Provides product image URLs with fallbacks and builds primary/secondary images or thumbnails.",
  "frontend/src/utils/siteContentDefaults.ts": "Returns default site content including hero text, sections, contact info, footer links, and dark-mode flag.",
  "frontend/src/utils/storefrontNav.ts": "Defines storefront navigation structure and homepage category cards with associated catalog filters.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning hash params.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp checkout URL with formatted order details and normalizes the target phone number.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, plugins, and container settings.",
  "project_state.json": "Tracks project state, known issues, and feature requests focused on fixing admin login and role bootstrapping."
}