{
  "backend/main.mo": "Defines the backend actor with product, cart, wishlist, lookbook, user session, guest session, and site content types plus storage maps and access control integration.",
  "backend/migration.mo": "Implements a migration that upgrades siteContent to include a new banners field and returns a new actor state.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of key frontend files including pages, components, hooks, and styling.",
  "frontend/.env.example": "Example environment file defining the WhatsApp number configuration variable.",
  "frontend/index.css": "Initializes Tailwind layers and defines extensive OKLCH-based CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component controlling navigation across storefront and admin pages with header, footer, and router-like state management.",
  "frontend/src/components/admin/HomepageBannersManager.tsx": "Admin UI for listing, adding, editing, and deleting homepage banners with form handling and mutations.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout component that handles authentication, admin checks, navigation, and renders the admin panel UI with a sidebar and header.",
  "frontend/src/components/Footer.tsx": "Footer component displaying navigation links, social media icons, branding, and contact links.",
  "frontend/src/components/GuestMergePrompt.tsx": "Dialog prompting users to merge guest cart or wishlist items into their authenticated account.",
  "frontend/src/components/Header.tsx": "Header with navigation, search, authentication handling, theme toggle, and cart/wishlist indicators for both guests and logged-in users.",
  "frontend/src/components/home/HomepageBannerRail.tsx": "Displays rotating homepage banner carousel with navigation, text decoding, and click routing.",
  "frontend/src/components/home/HomepageSectionRenderer.tsx": "Renders homepage content sections with titles, images, and text, ending with a navigation button.",
  "frontend/src/components/MediaSlotUploader.tsx": "Image upload widget that previews, uploads, replaces, and removes images using ExternalBlob with progress tracking.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing product image, price, colors, wishlist button, and quick-view navigation.",
  "frontend/src/components/RichTextEditor.tsx": "Simple rich text editor with formatting toolbar, contentEditable area, and HTML value syncing.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useGuestCart.ts": "Manages a guest user's cart locally with add, remove, and clear operations synced to local storage.",
  "frontend/src/hooks/useGuestWishlist.ts": "Manages a guest user's wishlist locally with add, remove, and clear operations using local storage.",
  "frontend/src/hooks/useHomepageBanners.ts": "Provides queries and mutations for fetching and modifying banners via the backend actor with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity authentication, loading stored identities, logging in, and clearing identity.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating products, cart, wishlist, lookbook, and admin product data via actor calls.",
  "frontend/src/hooks/useSiteContent.ts": "Fetches and mutates site content settings with fallbacks, including publishing and dark mode toggling.",
  "frontend/src/hooks/useThemeMode.ts": "Manages theme mode with localStorage overrides and applies light or dark classes to the document.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes with gold-focused design utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with mission, values, and imagery explaining the brand’s purpose and offerings.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Displays product categories with search and sortable stats derived from all products. Supports sorting by name or product count within an admin layout.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows admin overview with product, category, and lookbook statistics plus quick navigation actions. Computes inventory value and category counts using product data.",
  "frontend/src/pages/admin/AdminLookbook.tsx": "Manages lookbook images with search, sorting, and a dialog for adding or editing entries, including image uploads and tagged products. Uses backend queries and handles upload progress.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Provides full CRUD management for products with search, filtering, sorting, and image upload support. Includes a dialog for adding or editing product details.",
  "frontend/src/pages/admin/AdminSessions.tsx": "Displays informational user session and privacy details along with placeholder analytics cards. No dynamic data yet, mainly static descriptions within an admin layout.",
  "frontend/src/pages/admin/AdminSiteSettings.tsx": "Admin page for editing site content including hero text, contact details, banners, and dark mode, with draft and publish actions.",
  "frontend/src/pages/Cart.tsx": "Displays and manages the shopping cart using guest cart logic, product details, and item removal.",
  "frontend/src/pages/Checkout.tsx": "Builds a WhatsApp-based checkout summary using guest cart items and product data.",
  "frontend/src/pages/Contact.tsx": "Renders a contact page with hero text, contact info cards, and a basic non-functional contact form.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage with banners, category cards, featured products, and dynamically loaded site content.",
  "frontend/src/pages/Lookbook.tsx": "Shows a gallery of lookbook images with product tags and a dialog for detailed viewing.",
  "frontend/src/pages/ProductCatalog.tsx": "Implements product listing with category, size, color filters, sorting, and responsive filter UI.",
  "frontend/src/pages/ProductDetail.tsx": "Displays product images, details, selectable options, and supports adding to cart or wishlist.",
  "frontend/src/pages/Wishlist.tsx": "Shows wishlist items or an empty state, using product data to render saved products.",
  "frontend/src/utils/bannerDestination.ts": "Defines banner destination types and provides encode/decode helpers and click handler generation.",
  "frontend/src/utils/bannerEncoding.ts": "Utility for encoding and decoding banner text objects to and from JSON strings.",
  "frontend/src/utils/localCart.ts": "Manages guest cart persistence in localStorage with versioning and BigInt-safe serialization.",
  "frontend/src/utils/localWishlist.ts": "Handles guest wishlist storage and retrieval from localStorage with versioning.",
  "frontend/src/utils/siteContentDefaults.ts": "Provides default site content values including hero text, contact details, footer items, and banners.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp checkout URL with formatted order details from cart items.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, themes, container settings, animations, and plugin setup.",
  "project_state.json": "Describes project state, homepage redesign goals, feature requirements, and admin-editable banner needs."
}