{
  "backend/main.mo": "Defines core types and logic for products, carts, wishlists, lookbook images, site content, and authorization, integrating blob storage and access control for the backend canister.",
  "backend/migration.mo": "Provides a migration function that updates admin email and password fields in the actor state.",
  "feature_evidence.json": "Feature evidence report describing removal of token-based admin bootstrap UI, listing affected files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files covering routing, hooks, UI components, pages, styling, and admin layout behavior.",
  "frontend/.env.example": "Example environment file defining WhatsApp checkout target number and placeholders for additional variables.",
  "frontend/index.css": "Tailwind base file defining global OKLCH color variables, dark mode tokens, and shared component styling.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React router-like component handling URL parsing, page navigation, and state for catalog filters and product selection.",
  "frontend/src/components/admin/HomepageBannersManager.tsx": "Admin UI for creating, editing, and deleting homepage banners with image upload, text fields, and destination settings.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout component handling Internet Identity check, email/password admin login, navigation, and restricted-access UI rendering.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, navigation links, customer service links, and social icons, using onNavigate for routing. Includes dynamic year, logo, and structured link sections.",
  "frontend/src/components/GuestMergePrompt.tsx": "A modal prompting users to merge guest cart or wishlist items into their account, with configurable type and item count. Provides confirm and skip actions.",
  "frontend/src/components/Header.tsx": "Renders the main site header with navigation, search, mobile menu, auth handling, theme toggle, and cart/wishlist counts. Integrates user identity hooks and dynamic navigation behavior.",
  "frontend/src/components/home/HomepageBannerRail.tsx": "Displays rotating homepage banners with text, navigation buttons, and click handling based on banner destination.",
  "frontend/src/components/home/HomepageSectionRenderer.tsx": "Renders homepage content sections with optional titles, images, text, and a link to the About page.",
  "frontend/src/components/MediaSlotUploader.tsx": "Allows uploading, previewing, replacing, and removing an image using ExternalBlob with progress tracking. Provides validation and status feedback via toast notifications.",
  "frontend/src/components/ProductCard.tsx": "Displays an interactive product card with hover image swap, add-to-cart, wishlist, and quick view actions. Handles guest vs authenticated behavior and navigates to the product page.",
  "frontend/src/components/RichTextEditor.tsx": "A simple rich text editor using contentEditable with toolbar controls for formatting and links. Syncs HTML content through onChange and supports placeholders and focus styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useGuestCart.ts": "Manages a guest user's shopping cart stored in local storage with add, remove, and clear functions.",
  "frontend/src/hooks/useGuestWishlist.ts": "Handles guest wishlist persistence with add, remove, and clear operations using local storage.",
  "frontend/src/hooks/useHomepageBanners.ts": "React Query hooks for fetching and mutating homepage banners through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for products, cart, wishlist, lookbook, and admin product actions using an actor backend.",
  "frontend/src/hooks/useSiteContent.ts": "Fetches and updates site content including publishing and dark mode toggling with React Query.",
  "frontend/src/hooks/useThemeMode.ts": "Manages theme mode with localStorage override and applies dark/light classes based on site content.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, gold utilities, and base styling.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with mission, values, and images for the brand.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Provides an admin view for browsing, searching, and sorting product categories derived from products. Displays category statistics and supports sorting by name or product count.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard summarizing product, lookbook, category, and inventory stats with quick navigation. Loads product and lookbook data and computes derived stats.",
  "frontend/src/pages/admin/AdminLookbook.tsx": "Admin interface for managing lookbook images with search, sort, add, and edit functionality. Supports image uploads, tagging products, and editing metadata.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Admin UI for listing, filtering, sorting, creating, editing, and deleting products with image upload support.",
  "frontend/src/pages/admin/AdminSessions.tsx": "Admin page showing informational cards and placeholders for user session and cart analytics.",
  "frontend/src/pages/admin/AdminSiteSettings.tsx": "Admin interface for editing hero text, contact details, banners, and theme settings with draft and publish support.",
  "frontend/src/pages/Cart.tsx": "Displays and manages the shopping cart using guest cart logic and product lookup.",
  "frontend/src/pages/Checkout.tsx": "Shows order summary for guest cart and initiates WhatsApp-based checkout.",
  "frontend/src/pages/Contact.tsx": "Renders a contact page with hero text, contact info cards using site content, and a styled contact form.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage sections including hero banner, category cards, and featured/new products with navigation handlers.",
  "frontend/src/pages/Lookbook.tsx": "Shows a grid of lookbook images with product tags and an image detail dialog that links to related products.",
  "frontend/src/pages/ProductCatalog.tsx": "Implements a product catalog with filters, sorting, and responsive filter drawer, rendering filtered product cards.",
  "frontend/src/pages/ProductDetail.tsx": "Displays product images, details, size/color selectors, and actions for cart and wishlist with loading skeletons.",
  "frontend/src/pages/Returns.tsx": "Renders a returns and exchanges info page with policy details and guidance on returns, exchanges, and support. Uses cards and prose sections for structured instructions.",
  "frontend/src/pages/Shipping.tsx": "Displays shipping information including delivery times, packaging, processing, tracking, and policy details. Uses cards for key info and a prose section for the full policy.",
  "frontend/src/pages/Wishlist.tsx": "Shows wishlist items by combining wishlist IDs with product data, handling loading and empty states. Allows navigation to catalog or product pages.",
  "frontend/src/utils/adminAuthError.ts": "Parses backend auth errors into stable types for UI messaging, distinguishing invalid credentials from generic failures.",
  "frontend/src/utils/bannerDestination.ts": "Encodes, decodes, and handles navigation logic for banner destination metadata.",
  "frontend/src/utils/bannerEncoding.ts": "Utility to JSON-encode and decode banner text content with fallback handling.",
  "frontend/src/utils/localCart.ts": "Manages guest cart storage in localStorage with versioning and BigInt-safe serialization.",
  "frontend/src/utils/localWishlist.ts": "Handles guest wishlist persistence in localStorage with version checks.",
  "frontend/src/utils/siteContentDefaults.ts": "Provides default site content values including hero text, contact info, and initial settings.",
  "frontend/src/utils/storefrontNav.ts": "Defines storefront navigation structure and category cards with associated catalog filters.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing) and persist them in sessionStorage, plus utilities to clear stored or hash parameters.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp checkout URL by formatting cart item details into a message and normalizing the destination phone number.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, spacing, typography, container settings, animations, and theme extensions.",
  "project_state.json": "Describes current project issues and feature requests related to fixing admin email/password login and removing obsolete token-based bootstrap flows."
}