{
  "backend/main.mo": "Main Motoko actor defining product catalog, cart, lookbook, user profiles, banners, categories, site content, and admin authorization with persistent state and access control mixins.",
  "feature_evidence.json": "Feature evidence report documenting drag-and-drop file upload, drag-to-reorder images, numbered ordering system, and image re-upload/replacement functionality across admin panels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and utilities including routing, queries, admin panels, product management, and styling configurations.",
  "frontend/.env.example": "Environment variable template for WhatsApp configuration with default number 919826022251.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook documentation for retrying build and deploy operations locally or in CI with diagnostic output capture.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system, light/dark theme variables, and custom design tokens for sidebar, charts, and UI components.",
  "frontend/index.html": "HTML entry point for Fitting Point fashion e-commerce website with root div and module script reference.",
  "frontend/src/App.tsx": "Main React app with History API routing, QueryClient setup, theme provider, and page navigation logic for all public and admin routes.",
  "frontend/src/components/admin/AdminAuthDiagnostics.tsx": "Collapsible diagnostics component that displays parsed admin authentication errors with technical details, error types, and a copy-to-clipboard feature for debugging.",
  "frontend/src/components/admin/AdminSetupScreen.tsx": "One-time admin setup screen that welcomes authenticated users and guides them through admin registration using AdminSignupPanel, explaining the registration process and its implications.",
  "frontend/src/components/admin/AdminSignupPanel.tsx": "Admin registration form component that handles the one-time admin signup process, displays success state with the registered principal ID, and provides copy-to-clipboard functionality with error handling.",
  "frontend/src/components/admin/DraggableImageList.tsx": "Drag-and-drop image list component with reordering capabilities, optional numbered controls for manual order input, and remove functionality for managing ordered image collections.",
  "frontend/src/components/admin/HomepageBannersManager.tsx": "Admin interface for managing homepage banners with CRUD operations, drag-and-drop reordering, image upload via MediaSlotUploader, and form fields for title, description, and link with error handling.",
  "frontend/src/components/admin/MultiImageUploader.tsx": "A React component for uploading multiple images with drag-and-drop support, progress tracking, and the ability to remove or replace individual images. Uses ExternalBlob for file handling and enforces a configurable maximum image limit.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout wrapper with Internet Identity authentication, admin role verification, conditional AdminSetupScreen rendering when signup enabled, and access denied screen otherwise.",
  "frontend/src/components/Footer.tsx": "Footer component displaying site branding, navigation links (quick links and customer service), social media icons, and copyright information. Includes privacy policy link with app identifier for Instant.",
  "frontend/src/components/GuestMergePrompt.tsx": "Alert dialog component that prompts users to merge their guest cart or wishlist items with their account after login. Displays item count and provides confirm/skip options.",
  "frontend/src/components/Header.tsx": "Main header component with logo, navigation menu (desktop/mobile), search, cart/wishlist badges, theme toggle, and admin link. Includes dropdown navigation with subcategories and mobile sheet menu.",
  "frontend/src/components/home/BespokeSection.tsx": "Displays a promotional section for custom tailoring and bespoke design services with feature checkmarks and call-to-action buttons. Includes navigation to contact and catalog pages.",
  "frontend/src/components/home/ContactCtaSection.tsx": "A call-to-action section encouraging users to contact the business, featuring service icons (phone, email, location) and buttons to navigate to contact and about pages. Includes a decorative image with hover effects.",
  "frontend/src/components/home/CustomerReviewsSection.tsx": "Renders a grid of three hardcoded customer reviews with 5-star ratings, customer names, and testimonial text. Each review is displayed in a card with gold accent styling.",
  "frontend/src/components/home/HomepageBannerRail.tsx": "An auto-playing carousel component for homepage banners with navigation controls, slide indicators, and optional CTA buttons. Supports manual navigation and pauses auto-play on user interaction.",
  "frontend/src/components/home/HomepageProductSection.tsx": "Displays a grid of up to 8 products with a section title and optional 'View More' button that navigates to the catalog with filters. Uses ProductCard components for individual product rendering.",
  "frontend/src/components/home/HomepageSectionRenderer.tsx": "Renders dynamic content sections from SiteContentBlock data, displaying titles, images, and text content. Includes a 'Learn More' button linking to the about page.",
  "frontend/src/components/home/OffersSection.tsx": "Displays two promotional offer cards (Hajj and Umrah collections) with images, titles, and CTAs that navigate to filtered catalog pages.",
  "frontend/src/components/home/PartnersSection.tsx": "Renders a section displaying a partners logo strip image with heading and description.",
  "frontend/src/components/Logo.tsx": "Logo component that displays the site logo from backend or falls back to static asset. Supports three sizes (sm, md, lg) and uses backend-managed logo with alt text.",
  "frontend/src/components/MediaSlotUploader.tsx": "Image uploader component with drag-and-drop support, preview, replace/remove functionality, and upload progress tracking. Converts files to ExternalBlob for backend storage.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Intersection Observer-based component that reveals children with animation when scrolled into view, respecting reduced motion preferences.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image with hover swap effect, badges (new/bestseller/most loved), wishlist toggle, and add-to-cart button. Includes click navigation to product detail page.",
  "frontend/src/components/RichTextEditor.tsx": "Rich text editor component with toolbar for formatting (bold, italic, lists, links) using contentEditable div. Provides HTML output and supports placeholder text.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary component that catches runtime errors and displays a user-friendly error screen with stack traces, component stacks, and options to copy error details, export logs, or reload the application.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Provides admin authorization guard that verifies backend admin status before allowing mutations via requireAdmin function.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session state with login/logout functions, persisting session to local storage and coordinating with backend admin verification.",
  "frontend/src/hooks/useBackendReadiness.ts": "Polls backend readiness status via actor.isReady() with retry logic, providing canonical readiness state for the application.",
  "frontend/src/hooks/useGuestCart.ts": "Manages guest shopping cart state in local storage with add, remove, and clear operations for unauthenticated users.",
  "frontend/src/hooks/useGuestWishlist.ts": "Manages guest wishlist state in local storage with add, remove, and clear operations for product IDs.",
  "frontend/src/hooks/useHomepageBanners.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout with AuthClient, managing identity state and delegation validation.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and tracks user's prefers-reduced-motion media query preference for accessibility.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including admin verification, product management, cart operations, categories, lookbook images, banners, logos, and wishlist functionality with proper query invalidation and caching.",
  "frontend/src/hooks/useSiteContent.ts": "Provides React Query hooks for fetching and updating site content (hero text, contact details, dark mode, company name) with admin guard verification.",
  "frontend/src/hooks/useStorefrontAnnouncement.ts": "Empty file with no content.",
  "frontend/src/hooks/useThemeMode.ts": "Custom hook managing light/dark theme mode with localStorage persistence for user overrides and fallback to admin-configured default from site content.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, custom CSS variables for light/dark themes using OKLCH color space, and utility classes for gold accents, shadows, transitions, and scroll reveal animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "About page displaying company mission, values (quality, Sharia compliance, pilgrim focus, trustworthiness), and brand story for the Hajj-Umrah essentials shop.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Admin interface for managing product categories with CRUD operations, search, sorting by name/count, and displays product counts per category. Includes dialogs for create/edit and confirmation for delete.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing statistics (products, categories, lookbook images, catalog value) and quick action buttons to navigate to other admin pages. Uses AdminLayout wrapper.",
  "frontend/src/pages/admin/AdminLookbook.tsx": "Admin page for managing lookbook images with search, sort, and CRUD operations; supports tagging products to images and uses MediaSlotUploader for image uploads.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Admin page for managing products with filtering, sorting, and CRUD operations; includes multi-image upload, category assignment, and product metadata (type, usage category, bestseller flags).",
  "frontend/src/pages/admin/AdminSessions.tsx": "Admin page displaying session management overview; shows that the app uses guest sessions with local storage for cart/wishlist data and no server-side user tracking.",
  "frontend/src/pages/admin/AdminSiteSettings.tsx": "Admin page for configuring site-wide settings including hero text, contact details, company name, logo, dark mode toggle, homepage banners, and admin signup window closure.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with product details, quantities, and summary, supporting guest cart with remove functionality and navigation to checkout.",
  "frontend/src/pages/Checkout.tsx": "Checkout page showing order summary and WhatsApp checkout button that opens pre-filled WhatsApp message with order details for manual order completion.",
  "frontend/src/pages/Contact.tsx": "Contact page component displaying contact information cards (address, phone, email) with icons and a contact form with name, email, subject, and message fields. Uses site content hook to fetch dynamic contact details with rich text support.",
  "frontend/src/pages/Diagnostics.tsx": "Developer diagnostics page showing backend connectivity status, actor availability, runtime logs with filtering/export capabilities, and system health information for debugging deployment issues. Includes log level badges, refresh/clear controls, and JSON/text export functionality.",
  "frontend/src/pages/HomePage.tsx": "Homepage component orchestrating multiple sections including banner rail, offers, product sections (bestsellers, new, most loved), customer reviews, partners, contact CTA, and bespoke section. Fetches banners from backend with fallback to default banners and includes category cards for navigation.",
  "frontend/src/pages/Lookbook.tsx": "Lookbook gallery page displaying styled product images in a grid with hover effects and click-to-expand dialog. Shows tagged products for each lookbook image and links to product details.",
  "frontend/src/pages/ProductCatalog.tsx": "Product catalog page with sidebar filters (category, usage category, bestsellers, most loved, new) and sorting options (name, price). Combines managed categories with product-derived categories and displays filtered products in a grid using ProductCard components.",
  "frontend/src/pages/ProductDetail.tsx": "Displays detailed product information with image gallery, size/color selection, quantity controls, and add-to-cart/wishlist functionality. Integrates guest cart and wishlist hooks with navigation back to catalog.",
  "frontend/src/pages/Returns.tsx": "Static informational page explaining the 30-day return policy, exchange process, and customer support via WhatsApp. Uses cards to highlight key features like easy returns and support.",
  "frontend/src/pages/Shipping.tsx": "Static informational page detailing shipping times, packaging, processing, and tracking policies. Displays shipping information in card grid layout with icons.",
  "frontend/src/pages/Wishlist.tsx": "Displays user's wishlist items with options to remove items, clear all, or add to cart. Shows empty state when wishlist is empty and integrates with guest wishlist and cart hooks.",
  "frontend/src/utils/adminAuthError.ts": "Parses backend error messages into structured admin authentication errors with user-friendly messages and next-step guidance for various error types (anonymous access, authorization, signup closed, validation, etc.).",
  "frontend/src/utils/adminSession.ts": "Manages admin session persistence in localStorage with functions to get, save, clear, and reset session data including authentication status and reset tracking.",
  "frontend/src/utils/bannerDestination.ts": "Encodes/decodes banner destination data (catalog, product, external URL, or none) and provides click handlers for navigation based on destination type.",
  "frontend/src/utils/bannerEncoding.ts": "Encodes/decodes banner text data (title and optional subtitle) to/from JSON strings with fallback handling for plain text.",
  "frontend/src/utils/cartSummary.ts": "Defines CartSummary interface and calculateCartSummary function that transforms cart items with product data into a summary with line totals, subtotal, and item count.",
  "frontend/src/utils/currency.ts": "Provides formatINR and formatINRNumber functions for consistent INR currency formatting, converting prices from paise to rupees with proper locale formatting.",
  "frontend/src/utils/devLogBuffer.ts": "Implements an in-memory log buffer that intercepts console methods and captures unhandled errors/rejections, with export/download functionality for debugging.",
  "frontend/src/utils/localCart.ts": "Manages guest cart persistence in localStorage with versioning, handling serialization/deserialization of CartItem arrays including BigInt quantity conversion.",
  "frontend/src/utils/localWishlist.ts": "Manages guest wishlist persistence in localStorage with versioning, storing and retrieving arrays of product IDs.",
  "frontend/src/utils/productImageFallback.ts": "Provides getProductCardImages and getProductThumbnail functions that return safe image URLs with fallback handling for products with missing images.",
  "frontend/src/utils/selectSentinels.ts": "Defines sentinel values and utilities for shadcn-ui Select components to prevent empty-string values, providing conversion functions between filter and select values.",
  "frontend/src/utils/siteContentDefaults.ts": "Exports getSiteContentDefaults function that returns default SiteContent configuration including hero text, sections, contact details, and company name.",
  "frontend/src/utils/storefrontNav.ts": "Defines navigation structure with NavItem and SubCategory interfaces, including navigationStructure array for main nav and homepageCategoryCards for homepage tiles.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/src/utils/whatsapp.ts": "Exports buildWhatsAppCheckoutURL function that generates a WhatsApp message URL with formatted cart summary for order placement via WhatsApp.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for fonts, colors (including gold variants), shadows, animations, and plugins for animate and typography.",
  "project_state.json": "Project state tracking file for an e-commerce admin panel with existing drag-and-drop image upload/reordering features and a known price display formatting bug (₹299 showing as ₹2.99). Contains seven pending feature requests including product deletion, image management improvements, and banner customization options."
}