{
  "backend/main.mo": "Defines product, user, cart, lookbook, and admin types with persistent state and access control, plus an admin registration function with a one-time signup window.",
  "feature_evidence.json": "Lists feature evidence entries detailing required UI fixes related to SelectItem value handling and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose, routing, UI features, and data handling.",
  "frontend/.env.example": "Environment variable example containing default WhatsApp number configuration.",
  "frontend/DEPLOYMENT_RETRY.md": "Runbook describing steps to retry build and deployment with full diagnostics.",
  "frontend/index.css": "Tailwind base/theme configuration defining light and dark mode color variables and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the root div and main React script.",
  "frontend/src/App.tsx": "Main React app managing query client setup and History API routing for user and admin pages.",
  "frontend/src/components/admin/AdminAuthDiagnostics.tsx": "Shows admin authentication errors with next steps and expandable technical details plus copy-to-clipboard support.",
  "frontend/src/components/admin/AdminSetupScreen.tsx": "Admin setup page displaying registration instructions and embedding the admin signup panel with a help section.",
  "frontend/src/components/admin/AdminSignupPanel.tsx": "Handles admin registration flow, showing a form, success state with principal ID, and error handling through parsed auth errors.",
  "frontend/src/components/admin/HomepageBannersManager.tsx": "Admin interface for creating, editing, ordering, and deleting homepage banners with image uploads and error handling.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout component handling Internet Identity authentication, admin signup flow, and gated rendering of admin content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links, social icons, branding, and onNavigate handlers.",
  "frontend/src/components/GuestMergePrompt.tsx": "Provides a modal dialog prompting users to merge guest cart or wishlist items into their account.",
  "frontend/src/components/Header.tsx": "Implements the main site header with navigation, mobile menu, search handling, theme toggle, and cart/wishlist counts.",
  "frontend/src/components/home/BespokeSection.tsx": "Marketing section highlighting bespoke tailoring services with feature highlights and navigation buttons.",
  "frontend/src/components/home/ContactCtaSection.tsx": "Renders a contact call‑to‑action section with service icons and buttons that trigger navigation callbacks.",
  "frontend/src/components/home/CustomerReviewsSection.tsx": "Displays a grid of hardcoded customer reviews with star ratings inside styled cards.",
  "frontend/src/components/home/HomepageBannerRail.tsx": "Implements an auto‑playing hero banner slider with navigation controls and optional CTA actions.",
  "frontend/src/components/home/HomepageProductSection.tsx": "Shows a product grid with an optional filter-based 'View More' button leading to the catalog.",
  "frontend/src/components/home/HomepageSectionRenderer.tsx": "Renders CMS-provided homepage content blocks with optional images, text, and a link to the About page.",
  "frontend/src/components/home/OffersSection.tsx": "Displays promotional offer banners that navigate to filtered catalog pages when clicked.",
  "frontend/src/components/home/PartnersSection.tsx": "Shows a partners section with a title, description, and a strip of partner logos.",
  "frontend/src/components/Logo.tsx": "Displays the site logo using a backend-provided image or a fallback asset, with configurable sizing.",
  "frontend/src/components/MediaSlotUploader.tsx": "Handles image upload, preview, replacement, and removal for a media slot with progress feedback.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Reveals wrapped content when scrolled into view using IntersectionObserver with optional reduced‑motion support.",
  "frontend/src/components/ProductCard.tsx": "Shows a product card with hover image swap, wishlist and add‑to‑cart actions, and navigation to the product page.",
  "frontend/src/components/RichTextEditor.tsx": "A simple rich text editor with formatting controls, editable content, and onChange syncing.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "React error boundary that catches runtime errors and displays stack traces with options to copy details, export logs, or reload the app.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Provides a helper to ensure the caller is an admin and throws errors if authorization fails.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session state, login verification, and query invalidation using the backend's admin checks.",
  "frontend/src/hooks/useBackendReadiness.ts": "Checks backend readiness by calling actor.isReady and exposes status, errors, and retry logic.",
  "frontend/src/hooks/useGuestCart.ts": "Handles local guest cart state with add, remove, and clear operations synced to local storage.",
  "frontend/src/hooks/useGuestWishlist.ts": "Manages a guest wishlist list stored in local storage with add, remove, and clear helpers.",
  "frontend/src/hooks/useHomepageBanners.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identity from storage and exposing login, clear, and status flags.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user prefers reduced motion using a media query listener.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for admin checks, product data, and related mutations via the backend actor.",
  "frontend/src/hooks/useSiteContent.ts": "Fetches site content and provides admin-guarded mutations for updating content and toggling dark mode.",
  "frontend/src/hooks/useStorefrontAnnouncement.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useThemeMode.ts": "Computes theme mode from user override or site content and allows toggling with DOM updates.",
  "frontend/src/index.css": "Defines base theme variables, dark mode styles, typography, and utility classes using Tailwind layers.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/About.tsx": "Renders the About page with mission details, images, and value cards describing product qualities and brand focus.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Provides an admin interface for viewing, searching, sorting, creating, editing, and deleting product categories, including product count calculations.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Renders the admin dashboard with product, category, and lookbook stats plus quick navigation actions for common admin tasks.",
  "frontend/src/pages/admin/AdminLookbook.tsx": "Manages lookbook images with search, sort, upload, edit, tagging products, and progress-tracked image uploads.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Admin page for browsing, filtering, sorting, creating, and editing products, including image uploads and product metadata management.",
  "frontend/src/pages/admin/AdminSessions.tsx": "Displays admin session info and explains guest-only local session storage for cart and wishlist data.",
  "frontend/src/pages/admin/AdminSiteSettings.tsx": "Admin UI for editing site content, logo settings, and signup window controls using various backend hooks.",
  "frontend/src/pages/Cart.tsx": "Displays the shopping cart, loads product details, calculates totals, and supports item removal and navigation to product or catalog pages.",
  "frontend/src/pages/Checkout.tsx": "Shows an order summary and enables completing checkout through a pre-filled WhatsApp message based on cart contents.",
  "frontend/src/pages/Contact.tsx": "Provides contact details and a contact form, pulling dynamic site content and rendering location, phone, and email info.",
  "frontend/src/pages/Diagnostics.tsx": "Developer diagnostics page showing backend readiness, actor status, logs, and tools for refreshing, clearing, or exporting logs.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with banners, category cards, and curated product sections, pulling data from multiple product and banner queries. Provides navigation callbacks for CTAs and falls back to default banners if none are returned by the backend.",
  "frontend/src/pages/Lookbook.tsx": "Displays a grid of lookbook images with hover effects and a dialog for viewing details, including tagged products. Loads lookbook and product data and supports navigation when items are selected.",
  "frontend/src/pages/ProductCatalog.tsx": "Implements a filterable and sortable product catalog using category, usage, and product attributes. Fetches products and categories, applies filters, and renders product cards with a sidebar filter panel.",
  "frontend/src/pages/ProductDetail.tsx": "Shows detailed product info including gallery, sizes, colors, and quantity selection, and supports adding items to guest cart or wishlist. Handles loading/error states and provides navigation back to the catalog.",
  "frontend/src/pages/Returns.tsx": "Static returns and exchanges page explaining policies, steps, and support options using formatted sections and cards.",
  "frontend/src/pages/Shipping.tsx": "Static shipping information page outlining delivery times, packaging, processing, tracking, and policy details using informational cards.",
  "frontend/src/pages/Wishlist.tsx": "Implements a wishlist page that displays saved products, allows navigation to product pages, and supports removing items, clearing the list, and adding items to the cart.",
  "frontend/src/utils/adminAuthError.ts": "Parses admin-related errors into standardized messages and types for UI handling.",
  "frontend/src/utils/adminSession.ts": "Manages admin session persistence in localStorage with functions to get, save, clear, and reset sessions.",
  "frontend/src/utils/bannerDestination.ts": "Encodes, decodes, and handles banner navigation targets such as catalog pages, products, or external URLs.",
  "frontend/src/utils/bannerEncoding.ts": "Serializes and deserializes banner text data containing titles and optional subtitles.",
  "frontend/src/utils/cartSummary.ts": "Builds a summarized cart view with line totals, subtotal, and item counts from cart items.",
  "frontend/src/utils/currency.ts": "Formats values in paise into INR currency strings or numeric displays.",
  "frontend/src/utils/devLogBuffer.ts": "Captures console logs and errors in memory for export, tracking runtime logs with a buffered system.",
  "frontend/src/utils/localCart.ts": "Handles versioned localStorage persistence for guest cart items, including BigInt quantity conversion.",
  "frontend/src/utils/localWishlist.ts": "Stores and retrieves a versioned guest wishlist from localStorage with basic CRUD functions.",
  "frontend/src/utils/productImageFallback.ts": "Provides fallback-safe product image URLs for cards and thumbnails, defaulting to a static placeholder when images are missing.",
  "frontend/src/utils/selectSentinels.ts": "Defines a non-empty sentinel value and helpers to safely map select filter values and sanitize options to avoid empty-string SelectItem values.",
  "frontend/src/utils/siteContentDefaults.ts": "Returns default site content including hero text, contact details, footer items, and branding values.",
  "frontend/src/utils/storefrontNav.ts": "Defines the storefront navigation structure and homepage category cards with associated catalog filters.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp checkout URL by formatting cart item details, totals, and normalizing the destination phone number.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors, radii, shadows, animations, and plugin integration.",
  "project_state.json": "Project state metadata describing issues, existing features, and schema version info."
}