{
  "backend/main.mo": "Defines core backend types for products, carts, wishlists, lookbook images, sessions, and site content along with comparison utilities and access-control initialization. Mostly contains data models and module structures for the e‑commerce actor.",
  "feature_evidence.json": "Feature evidence report describing a frontend security improvement for admin login input trimming and accurate error handling, listing affected files and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including components, pages, hooks, styles, and admin interfaces.",
  "frontend/.env.example": "Example environment configuration file containing WhatsApp checkout number and placeholders for additional variables.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables for light/dark modes, global styles, and design tokens using OKLCH color values.",
  "frontend/index.html": "Root HTML document loading the React application entry point inside a single #root element.",
  "frontend/src/App.tsx": "Main React application controlling routing via History API, initializing React Query, and rendering all customer and admin pages based on URL.",
  "frontend/src/components/admin/HomepageBannersManager.tsx": "Admin UI for listing, creating, editing, and deleting homepage banners with form handling and mutations.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout component handling admin session checks, trimmed email/password login, logout, and navigation rendering for admin pages.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links, branding, and social icons, calling onNavigate for internal navigation. Includes dynamic year, logo, and structured link groups.",
  "frontend/src/components/GuestMergePrompt.tsx": "A modal prompt asking users whether to merge guest cart or wishlist items into their account. Supports confirm and skip actions with item count messaging.",
  "frontend/src/components/Header.tsx": "Renders the main header with navigation, search, theme toggle, mobile menu, and cart/wishlist counts. Uses guest data, admin detection, and onNavigate routing.",
  "frontend/src/components/home/HomepageBannerRail.tsx": "Displays rotating homepage banners with navigation controls and click handling based on banner destinations.",
  "frontend/src/components/home/HomepageSectionRenderer.tsx": "Renders homepage content sections with titles, images, and text, plus a button linking to the About page.",
  "frontend/src/components/MediaSlotUploader.tsx": "Image uploader component allowing upload, replacement, and removal of images with progress tracking. Wraps ExternalBlob handling and previews the current image.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image hover swap, quick view, add-to-cart, and wishlist actions. Navigates to product page and shows product badges.",
  "frontend/src/components/RichTextEditor.tsx": "A simple rich text editor with formatting toolbar using execCommand. Syncs HTML content with parent and supports placeholders and focus styling.",
  "frontend/src/hooks/useActor.ts": "Provides a reactive backend actor instance based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin login state using the backend actor and stores session info with React Query invalidation.",
  "frontend/src/hooks/useGuestCart.ts": "Handles guest cart state with add, remove, and clear operations persisted to local storage.",
  "frontend/src/hooks/useGuestWishlist.ts": "Manages a guest wishlist with add, remove, and clear functions stored in local storage.",
  "frontend/src/hooks/useHomepageBanners.ts": "React Query hooks for fetching and mutating homepage banners with admin-session checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/clear helpers, and initializes identities via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for products, cart, and admin product management with actor-based backend calls and cache invalidation.",
  "frontend/src/hooks/useSiteContent.ts": "Hooks to fetch and update site content, including publishing changes and toggling dark mode with admin validation.",
  "frontend/src/hooks/useThemeMode.ts": "Manages light/dark theme state based on user override or site settings, applying CSS classes and persisting user choice.",
  "frontend/src/index.css": "Tailwind-based global styles defining light and dark theme variables, gold accents, utilities, and imported serif fonts.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, global styles, and rendering the root App.",
  "frontend/src/pages/About.tsx": "About page showing mission, values, and images describing the brand’s focus on pilgrimage essentials.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Computes category stats from products and provides searchable, sortable category management.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows admin stats for products, lookbook images, categories, and inventory value with quick navigation.",
  "frontend/src/pages/admin/AdminLookbook.tsx": "Manages lookbook images with search, sorting, editing, and image upload functionality.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Admin interface for listing, filtering, sorting, creating, editing, and deleting products with image upload support.",
  "frontend/src/pages/admin/AdminSessions.tsx": "Static admin page displaying privacy info and placeholders for session and cart analytics.",
  "frontend/src/pages/admin/AdminSiteSettings.tsx": "Admin page for managing site content, drafts, publishing, dark mode, and homepage banners.",
  "frontend/src/pages/Cart.tsx": "Cart page displaying guest cart items, product details, totals, and navigation with remove-item functionality.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that builds an order summary from the guest cart and enables WhatsApp-based order submission.",
  "frontend/src/pages/Contact.tsx": "Renders the contact page with hero text, dynamic contact info, and a non-functional contact form. Pulls rich text contact details from site content hooks.",
  "frontend/src/pages/HomePage.tsx": "Displays the storefront home page with a hero section, category cards, and product sections using fetched products. Supports navigation via provided callback.",
  "frontend/src/pages/Lookbook.tsx": "Shows a grid of lookbook images with product tags and a dialog for detailed viewing. Fetches lookbook images and products, enabling navigation to product pages.",
  "frontend/src/pages/ProductCatalog.tsx": "Implements product listing with category, type, usage, and sorting filters using fetched products. Supports clearing/toggling filters and navigating to product details.",
  "frontend/src/pages/ProductDetail.tsx": "Displays detailed product info with image gallery, size/color selection, and add-to-cart/wishlist actions. Uses product and wishlist queries with mutation handlers.",
  "frontend/src/pages/Returns.tsx": "Displays return and exchange policies with cards and detailed instructions.",
  "frontend/src/pages/Shipping.tsx": "Shows shipping times, packaging details, tracking, and policy information.",
  "frontend/src/pages/Wishlist.tsx": "Loads wishlist items, handles loading/empty states, and displays saved products.",
  "frontend/src/utils/adminAuthError.ts": "Utility to classify backend admin auth errors into stable types for UI messaging.",
  "frontend/src/utils/adminSession.ts": "Handles storing, retrieving, and clearing admin authentication state in localStorage.",
  "frontend/src/utils/bannerDestination.ts": "Encodes, decodes, and handles navigation actions for banner destination metadata.",
  "frontend/src/utils/bannerEncoding.ts": "Provides JSON-based encoding and decoding for banner text content.",
  "frontend/src/utils/localCart.ts": "Manages guest cart persistence with versioning and BigInt-safe quantity handling.",
  "frontend/src/utils/localWishlist.ts": "Manages guest wishlist persistence with versioning in localStorage.",
  "frontend/src/utils/siteContentDefaults.ts": "Defines fallback default values for site content, including hero text and contact details.",
  "frontend/src/utils/storefrontNav.ts": "Defines storefront navigation structure and homepage category cards with category filters.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, retrieve, and clear URL or session-stored parameters, including support for hash-based routing.",
  "frontend/src/utils/whatsapp.ts": "Generates a WhatsApp checkout URL by formatting cart item details and total into an encoded message, with phone normalization.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, container settings, plugins, and extended utilities for the frontend styling system.",
  "project_state.json": "Stores project metadata including version, issues, feature requests, and architectural notes for the admin login fix."
}