{
  "backend/main.mo": "Defines core data types and modules for products, carts, wishlists, lookbook images, user sessions, site content, and integrates authorization and migration logic.",
  "backend/migration.mo": "Provides a migration function that overwrites stored admin credentials with new default email and password values.",
  "feature_evidence.json": "Placeholder feature evidence report containing an empty features list.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files for documentation or planning purposes.",
  "frontend/.env.example": "Example environment file defining the WhatsApp number used for checkout messaging.",
  "frontend/index.css": "Defines Tailwind base, component, and utility layers with extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React application managing routing, page state, and query client configuration across all user and admin pages.",
  "frontend/src/components/admin/HomepageBannersManager.tsx": "Admin interface for creating, editing, and deleting homepage banners, including image upload, text encoding, and destination settings.",
  "frontend/src/components/AdminLayout.tsx": "Admin layout component handling admin session login, logout, authorization checks, and rendering of admin-side navigation.",
  "frontend/src/components/Footer.tsx": "Footer component displaying navigation links, social icons, branding, and invoking navigation callbacks.",
  "frontend/src/components/GuestMergePrompt.tsx": "Shows a dialog prompting users to merge guest cart or wishlist items into their account and triggers confirm or skip actions.",
  "frontend/src/components/Header.tsx": "Renders the main site header with navigation, search, theme toggle, and guest cart/wishlist counts, including mobile menu handling.",
  "frontend/src/components/home/HomepageBannerRail.tsx": "Renders a rotating homepage banner carousel with navigation, decoded text, and route handling. Supports auto-advance, manual controls, and click actions based on banner destination.",
  "frontend/src/components/home/HomepageSectionRenderer.tsx": "Displays homepage content sections with optional titles, images, and text, filtering out empty sections. Includes a call-to-action button leading to the About page.",
  "frontend/src/components/MediaSlotUploader.tsx": "Handles image upload, preview, replacement, and removal using ExternalBlob with progress tracking and toasts.",
  "frontend/src/components/ProductCard.tsx": "Displays a product with hover image swap, badges, quick view, and guest cart/wishlist actions.",
  "frontend/src/components/RichTextEditor.tsx": "Provides a simple rich text editor with formatting controls and editable content synced to parent state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, recreating it on identity change. Invalidates dependent queries when the actor updates.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session state and login/logout operations using backend authentication. Updates stored session and invalidates relevant queries on login.",
  "frontend/src/hooks/useGuestCart.ts": "Provides local guest cart state with add, remove, and clear operations. Persists cart changes to local storage.",
  "frontend/src/hooks/useGuestWishlist.ts": "Manages a guest wishlist stored in local storage with add, remove, and clear functions. Ensures wishlist items are unique.",
  "frontend/src/hooks/useHomepageBanners.ts": "Offers queries and mutations for managing homepage banners, requiring admin auth for write operations. Automatically invalidates banner and site content queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for Internet Identity authentication, including login, logout, and stored identity restoration. Wraps AuthClient setup and exposes identity and login states.",
  "frontend/src/hooks/useQueries.ts": "Provides product, search, and admin product management queries and mutations using the backend actor. Also contains stubs for cart operations and invalidates caches on updates.",
  "frontend/src/hooks/useSiteContent.ts": "Provides React Query hooks to load, publish, and toggle dark mode for site content using an authenticated actor.",
  "frontend/src/hooks/useThemeMode.ts": "Manages theme mode with localStorage overrides and applies light/dark classes based on site content.",
  "frontend/src/index.css": "Defines Tailwind base styles and a premium light/dark theme palette with gold-accented utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with mission details, values, and product imagery for the brand.",
  "frontend/src/pages/admin/AdminCategories.tsx": "Builds category statistics from all products and provides searchable, sortable category listings in the admin panel.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows high-level product, category, and lookbook statistics plus quick navigation actions for admin users.",
  "frontend/src/pages/admin/AdminLookbook.tsx": "Manages lookbook images with search, sorting, upload/edit dialogs, and tagging products in the admin interface.",
  "frontend/src/pages/admin/AdminProducts.tsx": "Admin interface for listing, searching, sorting, creating, editing, and deleting products with image uploads.",
  "frontend/src/pages/admin/AdminSessions.tsx": "Displays session and privacy info with placeholder analytics for user sessions, carts, and wishlist data.",
  "frontend/src/pages/admin/AdminSiteSettings.tsx": "Admin UI page for editing site content, managing banners, theme settings, and publishing or saving drafts.",
  "frontend/src/pages/Cart.tsx": "Displays the shopping cart using guest cart data, allowing item removal and navigation to product or catalog pages.",
  "frontend/src/pages/Checkout.tsx": "Shows an order summary and generates a WhatsApp checkout link based on guest cart items.",
  "frontend/src/pages/Contact.tsx": "Displays contact details from site content and includes a styled contact form for user messages.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero, category cards, and featured product sections, using navigation callbacks and product queries.",
  "frontend/src/pages/Lookbook.tsx": "Displays a grid of lookbook images with a modal for details and tagged products, sourced from lookbook and product queries.",
  "frontend/src/pages/ProductCatalog.tsx": "Provides a filterable and sortable product catalog with category, type, and usage filters, rendering results as product cards.",
  "frontend/src/pages/ProductDetail.tsx": "Shows detailed product information with image gallery, size/color selection, and add-to-cart or wishlist actions.",
  "frontend/src/pages/Returns.tsx": "Static returns and exchanges page outlining policies and steps for initiating returns.",
  "frontend/src/pages/Shipping.tsx": "Static shipping information page detailing delivery times, packaging, processing, tracking, and policy details.",
  "frontend/src/pages/Wishlist.tsx": "Displays wishlist items by fetching saved product IDs and rendering matching ProductCards, with loading and empty states.",
  "frontend/src/utils/adminAuthError.ts": "Parses backend admin auth errors into stable types for UI messaging.",
  "frontend/src/utils/adminSession.ts": "Handles storing, retrieving, and clearing admin session data in localStorage.",
  "frontend/src/utils/bannerDestination.ts": "Encodes, decodes, and handles navigation behavior for banner destination metadata.",
  "frontend/src/utils/bannerEncoding.ts": "Serializes and deserializes banner text data with fallback handling.",
  "frontend/src/utils/localCart.ts": "Manages guest cart storage with versioning and BigInt-safe serialization.",
  "frontend/src/utils/localWishlist.ts": "Manages guest wishlist persistence with versioning in localStorage.",
  "frontend/src/utils/siteContentDefaults.ts": "Provides default site content values including hero text, contact details, and banners.",
  "frontend/src/utils/storefrontNav.ts": "Defines storefront navigation structure and homepage category cards with associated filters.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp checkout URL with formatted order details.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, containers, animations, and extensions.",
  "project_state.json": "Defines project metadata, known issues, and new feature requests focused on fixing admin authentication and improving related UI error handling."
}