{
  "kind": "build_request",
  "title": "Fix broken admin login/sign-up (Internet Identity + admin role bootstrapping)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the backend exposes an `isCallerAdmin()` method used by the frontend and that it returns `true` only when the caller has the admin role.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "admin login or sign up is not working"
        ]
      },
      "acceptanceCriteria": [
        "Calling `actor.isCallerAdmin()` from the frontend succeeds (no missing method / no candid mismatch).",
        "`isCallerAdmin()` returns `false` for non-admin principals and `true` for admin principals."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement an admin bootstrapping path so that admin login can succeed on a fresh deployment: if there are no admins yet, the first authenticated (non-anonymous) caller who attempts to access admin functionality is granted the admin role.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "admin login or sign up is not working"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh canister with no admins configured, the first non-anonymous principal to trigger the bootstrap flow becomes admin and `isCallerAdmin()` returns `true` for that principal afterward.",
        "Anonymous principals are never granted admin during bootstrapping.",
        "After at least one admin exists, no additional principals are automatically promoted to admin."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the admin panel login UI so it works with Internet Identity instead of the current non-functional Admin Key flow: when the viewer is anonymous, show a clear Internet Identity login/sign-up prompt; after login, verify admin status via `isCallerAdmin()` and either enter the admin panel or show an 'insufficient permissions' error state with recovery actions (retry/reset/logout).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "admin login or sign up is not working"
        ]
      },
      "acceptanceCriteria": [
        "If the user is not logged in (anonymous), the admin page shows a 'Log in with Internet Identity' call-to-action (English text) and does not misleadingly require an Admin Key.",
        "After successful Internet Identity login, the app re-checks `isCallerAdmin()` and navigates into the admin dashboard when the caller is an admin.",
        "If the logged-in user is not an admin, the UI shows an English error message indicating they do not have admin permissions and provides at least one recovery action (e.g., logout/switch account, retry verification, reset admin session)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a minimal diagnostics surface for admin auth failures: when admin verification fails (backend error or authorization trap), display the parsed error message (English) and provide a copyable error detail section suitable for sharing during support/debugging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "admin login or sign up is not working"
        ]
      },
      "acceptanceCriteria": [
        "When `useIsCallerAdmin()` errors, the admin gate screen shows an English summary plus a collapsible/copyable technical detail (e.g., the raw error message) without crashing the app.",
        "The existing `parseAdminAuthError` classification is used to drive user-facing messaging."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); add backend/migration.mo only if state schema changes require it.",
    "Do not edit files under frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose them instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding external databases (e.g., Supabase) or any off-chain storage.",
    "Implementing third-party authentication providers beyond Internet Identity.",
    "Building real-time admin presence or multi-admin invitation workflows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}