{
  "kind": "build_request",
  "title": "Improve image upload and ordering system",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement drag and drop file upload functionality for images throughout the admin panel, allowing administrators to drag image files directly into upload zones instead of using file picker dialogs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Allow drag and drop upload."
        ]
      },
      "acceptanceCriteria": [
        "Image upload zones accept dragged files and display visual feedback during drag-over",
        "Dropped files are validated and uploaded automatically",
        "Existing click-to-upload functionality remains available"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add drag-to-reorder functionality for images, allowing administrators to reorder images by dragging them to new positions within the image list or gallery.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Allow drag to reorder OR numbered order system."
        ]
      },
      "acceptanceCriteria": [
        "Images can be reordered by dragging them to new positions",
        "Visual feedback shows the target drop position during drag",
        "Reordering persists to the backend when completed"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a numbered order system as an alternative to drag-to-reorder, allowing administrators to assign explicit numeric positions to images for precise ordering control.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Allow drag to reorder OR numbered order system."
        ]
      },
      "acceptanceCriteria": [
        "Each image displays its current position number",
        "Administrators can edit position numbers directly",
        "Images automatically reorder when position numbers are changed"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Enable re-upload and replacement functionality for all existing images and placeholders across the site, including offer images, product category banners, homepage banners, lookbook images, product images, and the site logo.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Allow me to re-upload or replace all current images or placeholders already on the site, including offer images and product category banners."
        ]
      },
      "acceptanceCriteria": [
        "Every image slot in the admin panel shows a replace/re-upload option",
        "Replacing an image updates the display immediately without requiring page refresh",
        "Placeholder images can be replaced with actual images using the same interface",
        "The replacement action preserves all associated metadata (alt text, links, etc.)"
      ]
    }
  ],
  "constraints": [
    "Maintain single-actor backend architecture with all logic in backend/main.mo",
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui"
  ],
  "nonGoals": [
    "Implementing third-party drag-and-drop libraries beyond what's necessary",
    "Adding bulk image operations or batch processing",
    "Creating new image types or categories beyond what currently exists"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}