{
  "kind": "build_request",
  "title": "Fix admin email/password login rejecting valid credentials",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend admin authentication so that logging in with the configured credentials (email: fitting.point.official@gmail.com, password: Farhan@456) successfully grants admin privileges to the current caller and does not fail due to authorization/initialization state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "but with this mail and password its saying invalid so work on that"
        ]
      },
      "acceptanceCriteria": [
        "Calling authenticateAdminWithEmailPassword(\"fitting.point.official@gmail.com\", \"Farhan@456\") does not trap.",
        "After a successful authenticateAdminWithEmailPassword call, actor.isCallerAdmin() returns true for the same caller/session.",
        "Calling authenticateAdminWithEmailPassword with incorrect credentials still traps with an authentication/invalid-credentials error message (no silent success)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Harden the admin login request on the frontend by trimming email/password inputs before sending them to authenticateAdminWithEmailPassword, and ensure the UI displays an invalid-credentials message only when credentials are actually wrong (not when backend errors are unrelated).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "but with this mail and password its saying invalid so work on that"
        ]
      },
      "acceptanceCriteria": [
        "Admin login from /admin succeeds when the user enters fitting.point.official@gmail.com and Farhan@456 (including if the user accidentally adds leading/trailing spaces).",
        "After a successful login, the admin panel renders the authenticated admin layout (navigation + logout button) without requiring a refresh.",
        "If the backend throws a non-credential error (e.g., actor not available), the UI shows a generic failure message rather than 'Invalid email or password'."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/hooks/useActor.ts and frontend/src/hooks/useInternetIdentity.ts*)."
  ],
  "nonGoals": [
    "Implementing a full token-based admin session system across all admin mutations/queries (beyond making the current credentials-based login work).",
    "Adding new authentication providers (Internet Identity or third-party auth)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}