{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Shadcn Select crash from empty SelectItem values in catalog/admin product pages",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove any SelectItem empty-string values from Product Catalog filters while keeping an explicit “All/no filter” state.",
      "acceptanceCriteria": [
        "Visiting the Product Catalog page no longer throws the Select.Item empty-string runtime error.",
        "Category filter supports an \"All Categories\" option without using an empty string SelectItem value.",
        "Usage filter supports an \"All\" option without using an empty string SelectItem value.",
        "Clearing a filter results in the intended unfiltered state in the product grid."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/selectSentinels.ts",
          "operation": "create",
          "description": "Introduce shared non-empty sentinel constants/helpers (e.g., for “All”/“no filter” selections) to prevent rendering shadcn-ui SelectItem with an empty-string value. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProductCatalog.tsx",
          "operation": "modify",
          "description": "Update Category and Usage shadcn-ui Select usage to (1) replace SelectItem value=\"\" with a non-empty sentinel, (2) map sentinel back to “no filter” in filtering logic, and (3) filter/guard category option values so empty/whitespace category names are never rendered as SelectItems. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Audit admin products and related product flows to ensure no SelectItem renders with an empty-string value, including dynamically generated options.",
      "acceptanceCriteria": [
        "Admin Products page loads without triggering the Select.Item empty-string runtime error.",
        "No Select dropdown in admin/product flows renders an item whose value prop is an empty string.",
        "If backend/category data contains empty-string names, they are not rendered as SelectItems and do not crash the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminProducts.tsx",
          "operation": "modify",
          "description": "Audit all shadcn-ui Select/SelectItem usage (product list filters + product create/edit form). Ensure no SelectItem is created with value \"\" by (1) using a non-empty sentinel for any “All/no filter” selection and (2) filtering/mapping dynamically-generated option values (e.g., categories) to exclude empty/whitespace strings so they are never rendered. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/selectSentinels.ts",
          "operation": "modify",
          "description": "Extend shared helpers as needed to support admin/product Selects (e.g., sanitize option lists and map to/from sentinel values) so future SelectItem generation cannot accidentally emit empty-string values. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}